app/Controllers/Pages.php

SELECT *
FROM `beladiri`
---
    public function index()
    {
        $data = [
            "title" => "HOME | Forum Beladiri",
            "beladiri" => $this->beladirimodel->findAll(),