app/Controllers/User.php

UPDATE `user` SET `username` = 'admin', `img` = 'images_3.jpg'
WHERE `user`.`username` IN ('admin')
---
    public function updateProfile()
    {
        if (!$this->validate([
            'img' => [
                'rules' => 'uploaded[img]|max_size[img,1024]|is_image[img]|mime_in[img,image/jpg,image/jpeg,image/png]',
                'errors' => [
                    'uploaded' => 'pilih gambar terlebih dahulu',
                    'max_size' => 'ukuran gambar terlalu besar',
                    'is_image' => 'yang anda pilin bukan file gambar',
                    'mime_in' => 'yang anda pilin bukan file gambar',
                ]
            ]
        ])) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }

        $fileimg = $this->request->getFile('img');
        $fileimg->move('img/core-img');
        $namaimg = $fileimg->getName();
        $this->usermodel->save([
            'username' => session()->get('username'),
            'img' => $namaimg,
        ]);