app/Controllers/User.php

UPDATE `user` SET `username` = 'admin', `name` = 'aditya candra permana', `email` = '210103185@mhs.udb.ac.id'
WHERE `user`.`username` IN ('admin')
UPDATE `user` SET `username` = 'admin', `name` = 'aditya candra permana', `email` = '', `img` = '604d5c53f9061869db343c96a19ab569.jpg'
WHERE `user`.`username` IN ('admin')
---
    public function updateProfile()
    {
        if ($this->validate([
            'img' => [
                'rules' => 'max_size[img,1024]|is_image[img]|mime_in[img,image/jpg,image/jpeg,image/png]',
                'errors' => [
                    'max_size' => 'ukuran gambar terlalu besar',
                    'is_image' => 'yang anda pilin bukan file gambar',
                    'mime_in' => 'yang anda pilin bukan file gambar',
                ]
            ]
        ])) {
            $fileimg = $this->request->getFile('img');
            $namaimg = $fileimg->getName();
        } else {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }

        if (empty($namaimg)) {
            $this->usermodel->save([
                'username' => session()->get('username'),
                'name' => $this->request->getVar('name'),
                'email' => $this->request->getVar('email'),
            ]);
            return redirect()->back()->with('massage', 'Data Berhasil di Simpan');
        } else {
            $this->usermodel->save([
                'username' => session()->get('username'),
                'name' => $this->request->getVar('name'),
                'email' => $this->request->getVar('email'),
                'img' => $namaimg,
            ]);