app/Models/BeladiriModel.php

    public function getDetailBeladiri($id)
    {
        $builder = $this->db->table('beladiri');
        $builder->where('id', $id);
        return $builder->get()->getResult();
---
SELECT *
FROM `beladiri`
WHERE `id` = '6'