app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
---
    public function getProfile()
    {
        $builder = $this->db->table('user');
        $builder->where('username', session()->get('username'));
        return $builder->get()->getResultArray();